<a href="https://colab.research.google.com/github/frank-morales2020/MLxDL/blob/main/deepseek_text2sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## fine tune

In [ ]:
# --- 1. Set Up Your Environment ---
!pip install scikit-learn -q # For potential evaluation metrics (optional)
!pip install -U transformers -q
!pip install -U datasets -q
!pip install -U accelerate -q
!pip install -U peft -q
!pip install -U trl -q # For SFTTrainer
!pip install -U bitsandbytes -q
!pip install unsloth -q # Recommended for speed and efficiency
!pip install --force-reinstall --no-cache-dir --no-deps git+https://github.com/unslothai/unsloth.git # For latest Unsloth

In [2]:
!rm -rf /content/deepseek_r1_text2sql_finetuned

In [ ]:
# 0. Initial Setup
# Install necessary libraries if running in Colab/Jupyter (ensure these are installed first)
# !pip install -U transformers datasets accelerate peft trl bitsandbytes unsloth scikit-learn
import torch
import io
import pandas as pd
import json
from datasets import load_dataset, Dataset # Added Dataset for potential manual splits
from unsloth import FastLanguageModel
from trl import SFTTrainer
from transformers import TrainingArguments, TextStreamer, AutoTokenizer
from huggingface_hub import login # Optional: for pushing model to Hub

# Ensure you are logged into Hugging Face if you plan to push models or use private datasets
# login() # Uncomment and run if needed

# 1. Load the Model and Tokenizer
print("Loading DeepSeek-R1 model and tokenizer...")
model, tokenizer = FastLanguageModel.from_pretrained(
    model_name="unsloth/DeepSeek-R1-Distill-Llama-8B",
    max_seq_length=2048, # Adjust if your combined input/output is longer
    dtype=None, # Automatically chooses bfloat16 or float16 based on GPU
    load_in_4bit=True, # Enable 4-bit quantization for memory efficiency
)
print("Model and tokenizer loaded.")

# 2. Apply LoRA Adapters
print("Applying LoRA adapters...")
model = FastLanguageModel.get_peft_model(
    model,
    r=16, # Rank of the LoRA matrices (common values: 8, 16, 32, 64)
    target_modules=["q_proj", "k_proj", "v_proj", "o_proj", "gate_proj", "up_proj", "down_proj"],
    lora_alpha=16, # Scaling factor for LoRA weights
    lora_dropout=0, # Dropout rate for LORA (set to 0 for inference)
    bias="none", # Or "all", "lora_only"
    use_gradient_checkpointing=True, # Recommended for memory saving
    random_state=3407,
    use_rslora=False,
    loftq_config=None,
)
print("LoRA adapters applied.")

# 3. Load Dataset
print("Loading and preparing b-mc2/sql-create-context dataset...")

# Load the dataset directly from the Hugging Face Hub
dataset_name = "b-mc2/sql-create-context"
full_dataset = load_dataset(dataset_name)

# The b-mc2/sql-create-context dataset typically has a single 'train' split.
# You might need to split it manually for training and evaluation.
# Let's assume we still want a 90/10 split.
raw_dataset_split = full_dataset['train'].train_test_split(test_size=0.1, seed=42)
train_dataset_raw = raw_dataset_split['train']
eval_dataset_raw = raw_dataset_split['test']


# --- NEW: Select a specific number of samples ---
# Define the desired number of samples for training and evaluation
num_train_samples = 12000 # Set your desired number of training samples
num_eval_samples = 1000  # Set your desired number of evaluation samples

# Ensure the desired number of samples doesn't exceed the available samples
num_train_samples = min(num_train_samples, len(train_dataset_raw))
num_eval_samples = min(num_eval_samples, len(eval_dataset_raw))

# Select the desired number of samples from the raw splits
# We use slicing [start:end] to select the first `num_..._samples` entries
train_dataset_selected = train_dataset_raw.select(range(num_train_samples))
eval_dataset_selected = eval_dataset_raw.select(range(num_eval_samples))

print(f"Raw dataset loaded from {dataset_name}. Training entries: {len(train_dataset_raw)}, Evaluation entries: {len(eval_dataset_raw)}")
print('\n')
print(f"Selected sample sizes: Training entries: {len(train_dataset_selected)}, Evaluation entries: {len(eval_dataset_selected)}")
# --- END NEW ---


# 4. Define the Formatting Function for Text-to-SQL
# This function converts entries from b-mc2/sql-create-context dataset
# into the chat format that the DeepSeek-R1 model will be trained on.

def format_sql_example(example):
    """
    Formats an example from the b-mc2/sql-create-context dataset into a chat template.

    Args:
        example (dict): A dictionary representing one row in the dataset.
                        Expected keys: 'question', 'context', 'answer'.

    Returns:
        dict: The example dictionary with an added 'text' key containing the
              formatted chat string.
    """
    # Extract data from the dataset example
    question = example["question"]
    context = example["context"] # This usually contains the CREATE TABLE statements
    answer = example["answer"]   # This is the correct SQL query

    # Construct the prompt for the model
    # The prompt should provide the database schema as context and the user's question.
    # The model should learn to generate the SQL query (the 'answer').
    instruction = "Given the database schema below, write a SQL query that answers the following question."

    full_user_prompt = f"{instruction}\n\nDatabase Schema:\n{context}\n\nQuestion: {question}"

    # Combine into the chat format for training
    # The 'user' role contains the context and question.
    # The 'assistant' role contains the target SQL query.
    messages = [
        {"role": "user", "content": full_user_prompt},
        {"role": "assistant", "content": answer}
    ]

    # Apply the chat template using the tokenizer.
    # tokenize=False returns a string.
    # add_special_tokens=False prevents adding BOS/EOS tokens here,
    # as the SFTTrainer handles tokenization and special tokens during training.
    example["text"] = tokenizer.apply_chat_template(messages, tokenize=False, add_special_tokens=False)

    return example

# Apply the formatting function to your selected datasets
print("Applying formatting function to datasets for Text-to-SQL...")

# --- MODIFIED: Use the selected datasets for mapping ---
# Instead of mapping over train_dataset_raw and eval_dataset_raw,
# we map over the datasets that contain the selected number of samples.
train_dataset = train_dataset_selected.map(format_sql_example, batched=False)
eval_dataset = eval_dataset_selected.map(format_sql_example, batched=False)
# --- END MODIFIED ---

print("Dataset preparation complete with Text-to-SQL formatting.")
print("Dataset preparation complete with Text-to-SQL formatting.")

# 5. Set Up and Configure the Trainer
print("Setting up SFTTrainer...")
trainer = SFTTrainer(
    model=model,
    tokenizer=tokenizer,
    train_dataset=train_dataset, # Now using the formatted datasets
    eval_dataset=eval_dataset,   # Now using the formatted datasets
    dataset_text_field="text", # This field holds the formatted chat messages
    max_seq_length=2048, # Ensure this is sufficient for your long itineraries
    args=TrainingArguments(
        per_device_train_batch_size=2,
        gradient_accumulation_steps=1,
        warmup_steps=10,
        num_train_epochs=3,
        learning_rate=2e-4,
        fp16=not torch.cuda.is_bf16_supported(), # Use fp16 if bfloat16 not supported
        bf16=torch.cuda.is_bf16_supported(),     # Use bf16 if supported (recommended)
        logging_steps=10,
        #output_dir="./deepseek_r1_tourism_planner_finetuned", # Consistent output directory name
        output_dir="./deepseek_r1_text2sql_finetuned", # Consistent output directory name
        optim="adamw_8bit",
        seed=3407,
        save_steps=2500,
        save_total_limit=2,
        eval_strategy="steps",
        eval_steps=2500,
        load_best_model_at_end=True,
        metric_for_best_model="eval_loss",
        greater_is_better=False, # Lower loss is better
        report_to="none", # Disable logging to Weights & Biases if not needed
    ),
)
print("SFTTrainer configured.")

In [2]:
# 6. Start Training
print('\n')
print("Starting training...")
from unsloth import unsloth_train
# trainer_stats = trainer.train() << Buggy gradient accumulation
# https://unsloth.ai/blog/gradient
trainer_stats = unsloth_train(trainer)
#trainer.train() # Uncomment to start the training
print("Training complete.")
print('\n')


# 7. Save Your Fine-tuned Model
#output_dir = "./deepseek_r1_tourism_planner_finetuned"
output_dir = "./deepseek_r1_text2sql_finetuned"
print(f"Saving fine-tuned model to {output_dir}...")
model.save_pretrained(output_dir, tokenizer) # Uncomment to save the model and tokenizer
print("Model saved locally.")

Starting training...

==((====))==  Unsloth - 2x faster free finetuning | Num GPUs used = 1
   \\   /|    Num examples = 12,000 | Num Epochs = 3 | Total steps = 18,000
O^O/ \_/ \    Batch size per device = 2 | Gradient accumulation steps = 1
\        /    Data Parallel GPUs = 1 | Total batch size (2 x 1 x 1) = 2
 "-____-"     Trainable parameters = 41,943,040/8,000,000,000 (0.52% trained)

Unsloth: Will smartly offload gradients to save VRAM!
Training complete.


Saving fine-tuned model to ./deepseek_r1_text2sql_finetuned...
Model saved locally.

## Upload Model to Hugging Face Hub

In [ ]:
!pip install unsloth -q # Recommended for speed and efficiency
!pip install --force-reinstall --no-cache-dir --no-deps git+https://github.com/unslothai/unsloth.git # For latest Unsloth
!pip install colab-env -q
import colab_env

In [ ]:
# 1. Load the Model and Tokenizer
from unsloth import FastLanguageModel
print("Loading DeepSeek-R1 model and tokenizer...")
model, tokenizer = FastLanguageModel.from_pretrained(
    model_name="unsloth/DeepSeek-R1-Distill-Llama-8B",
    max_seq_length=2048, # Adjust if your combined input/output is longer
    dtype=None, # Automatically chooses bfloat16 or float16 based on GPU
    load_in_4bit=True, # Enable 4-bit quantization for memory efficiency
)
print("Model and tokenizer loaded.")

# 2. Apply LoRA Adapters
print("Applying LoRA adapters...")
model = FastLanguageModel.get_peft_model(
    model,
    r=16, # Rank of the LoRA matrices (common values: 8, 16, 32, 64)
    target_modules=["q_proj", "k_proj", "v_proj", "o_proj", "gate_proj", "up_proj", "down_proj"],
    lora_alpha=16, # Scaling factor for LoRA weights
    lora_dropout=0, # Dropout rate for LORA (set to 0 for inference)
    bias="none", # Or "all", "lora_only"
    use_gradient_checkpointing=True, # Recommended for memory saving
    random_state=3407,
    use_rslora=False,
    loftq_config=None,
)
print("LoRA adapters applied.")

In [4]:
output_dir = "/content/gdrive/MyDrive/model/deepseek_r1_text2sql_finetuned" # Example Google Drive path or local path
model.save_pretrained(output_dir, tokenizer)

In [ ]:
#huggingface_repo_id = "your_username/deepseek_r1_text2sql_finetuned"
huggingface_repo_id = "frankmorales2020/deepseek_r1_text2sql_finetuned"

try:
    # Push the saved model and tokenizer to the Hugging Face Hub
    # You must be logged in for this to work
    model.push_to_hub(huggingface_repo_id, tokenizer=tokenizer)
    print(f"Successfully pushed model to Hugging Face Hub: https://huggingface.co/{huggingface_repo_id}")

except Exception as e:
    print(f"Error pushing model to Hugging Face Hub: {e}")
    print("Please ensure you have logged in using `huggingface_hub.login()` and have write access to the repository.")

print("Push to Hugging Face Hub process complete.")

## Model evaluation

In [3]:
!pip install colab-env -q
import colab_env

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [4]:
!rm -rf /content/gdrive/MyDrive/model/deepseek_r1_text2sql_finetuned
!cp -r /content/deepseek_r1_text2sql_finetuned /content/gdrive/MyDrive/model/deepseek_r1_text2sql_finetuned

In [5]:
!pip install rouge_score -q
!pip install sacrebleu -q

In [7]:
## Model evaluation Refactored for b-mc2/sql-create-context dataset
# --- Evaluation Code Block ---

import torch
import json
import pandas as pd # For saving results
from datasets import load_dataset # For loading evaluation data

# Import libraries for model loading and generation
from transformers import AutoTokenizer, AutoModelForCausalLM, TextStreamer # TextStreamer is optional
from unsloth import FastLanguageModel # Using Unsloth for efficient loading

# Import libraries for metrics calculation
from rouge_score import rouge_scorer
import sacrebleu
import numpy as np # For calculating averages

# --- Configuration ---
# Define the path where your fine-tuned model was saved
# Make sure this path points to the directory containing the saved model files
# This path should now point to the model fine-tuned on the SQL dataset
fine_tuned_model_path = "/content/gdrive/MyDrive/model/deepseek_r1_text2sql_finetuned" # Example Google Drive path or local path

# Define the name of the dataset from Hugging Face Hub
dataset_name = "b-mc2/sql-create-context"

# Number of examples from the evaluation set to run inference on
# Set to a smaller number for quick testing, or len(eval_dataset) for full evaluation
num_examples_to_evaluate = 999

# Maximum sequence length used during fine-tuning (must match)
max_seq_length = 2048 # Ensure this matches the value used during training

# --- 1. Load the Fine-tuned Model and Tokenizer ---
print(f"Loading fine-tuned model from {fine_tuned_model_path}...")
try:
    model, tokenizer = FastLanguageModel.from_pretrained(
        model_name=fine_tuned_model_path, # Load from your saved model directory
        max_seq_length=max_seq_length,     # Must match the max_seq_length used during fine-tuning
        dtype=None,                        # Will auto-detect from saved config
        load_in_4bit=True,                 # Load in 4-bit for memory efficiency
    )
    # Ensure the model is on GPU if available
    if torch.cuda.is_available():
        model.to("cuda")
        print("Model moved to GPU.")
    else:
        print("CUDA not available. Model loading on CPU (will be slower).")
except Exception as e:
    print(f"Error loading model: {e}")
    print("Please check that the model path is correct and the model files exist.")
    # Exit or handle the error appropriately if model loading fails
    exit() # Example: Exit the script


print("Model and tokenizer loaded.")

# Optional: Set up TextStreamer for real-time output during generation
# streamer = TextStreamer(tokenizer, skip_prompt=True, skip_special_tokens=True)

# --- 2. Load the Evaluation Dataset ---
# We will load the same dataset used for training but use the test split
print(f"Loading evaluation dataset from {dataset_name}...")
try:
    # Load the dataset directly from the Hugging Face Hub
    full_dataset = load_dataset(dataset_name)

    # The b-mc2/sql-create-context dataset typically has a single 'train' split.
    # We split it manually for training and evaluation, 90/10 split, same seed as training.
    raw_dataset_split_for_eval = full_dataset['train'].train_test_split(test_size=0.1, seed=42)
    # Use the 'test' split created here for evaluation
    eval_dataset = raw_dataset_split_for_eval['test']


    print(f"Evaluation dataset loaded with {len(eval_dataset)} entries.")

    # Adjust num_examples_to_evaluate if it's larger than the available dataset
    num_examples_to_evaluate = min(num_examples_to_evaluate, len(eval_dataset))
    # Select the specific number of examples for evaluation
    eval_dataset_selected = eval_dataset.select(range(num_examples_to_evaluate))

    print(f"Evaluating on {len(eval_dataset_selected)} examples from the test set.")

except FileNotFoundError:
    print(f"Error: Dataset file not found at {dataset_name}")
    print("Please ensure you have access to the dataset on the Hugging Face Hub.")
    exit() # Example: Exit if dataset not found
except Exception as e:
    print(f"Error loading dataset: {e}")
    exit()


# --- 3. Define the PROMPT CONSTRUCTION function for inference ---
# This function should mirror the 'user' part of your formatting function used during training.
# It takes raw data and turns it into the prompt the model expects for SQL generation.

def construct_sql_inference_prompt(question, context):
    """Constructs the full user prompt for the model based on SQL question and schema context."""

    # The instruction for the model to generate a SQL query
    instruction = "Given the database schema below, write a SQL query that answers the following question."

    # Construct the full user prompt for the model
    full_user_prompt = f"{instruction}\n\nDatabase Schema:\n{context}\n\nQuestion: {question}"

    # Apply the chat template for the single user turn
    messages = [{"role": "user", "content": full_user_prompt}]

    # Tokenize the prompt for generation
    tokenized_input = tokenizer.apply_chat_template(messages, return_tensors="pt", add_special_tokens=True)

    # Move input to GPU if CUDA is available
    if torch.cuda.is_available():
        tokenized_input = tokenized_input.to("cuda")

    return tokenized_input


# --- 4. Evaluation Loop with Metrics ---
print("\n--- Starting Evaluation Loop ---")
results = []
rouge_scores = []
bleu_scores = [] # Note: BLEU might not be the best metric for SQL, but we'll include it for comparison.

# Initialize ROUGE scorer
# using 'rouge1', 'rouge2', and 'rougeL' f-measure (F1 score)
rouge_scorer_obj = rouge_scorer.RougeScorer(['rouge1', 'rouge2', 'rougeL'], use_stemmer=True)

# Generation parameters (can be adjusted)
generation_kwargs = {
    "max_new_tokens": 512,
    "use_cache": True,
    "temperature": 0.1,     # Often lower temperature for code/SQL generation for more deterministic output
    "top_p": 0.9,          # Adjust nucleus sampling
    "do_sample": True,      # Enable sampling
    "pad_token_id": tokenizer.eos_token_id, # Set padding token
    #"streamer": streamer,  # Uncomment if using TextStreamer
}


# Loop through the selected evaluation examples
for i in range(len(eval_dataset_selected)): # Use the length of the selected dataset
    example = eval_dataset_selected[i] # Access example from the selected subset
    original_question = example["question"]
    database_context = example["context"] # This is the database schema
    ground_truth_answer = example["answer"] # This is the correct SQL query


    print(f"\n--- Evaluation Case {i+1}/{len(eval_dataset_selected)} ---")
    print(f"Original Question: {original_question}")
    print(f"Database Schema:\n{database_context}")


    print("\n--- Ground Truth SQL Query (from dataset) ---\n")
    print(ground_truth_answer)


    # Construct the prompt for the model and get token IDs
    input_ids = construct_sql_inference_prompt(original_question, database_context)

    # Generate the SQL query using the model
    try:
        # Note: The model was fine-tuned to output the SQL query immediately after the user prompt.
        # We generate starting from the end of the prompt.
        outputs = model.generate(
            input_ids=input_ids,
            **generation_kwargs # Pass the generation parameters
        )

        generated_text = tokenizer.decode(outputs[0][input_ids.shape[1]:], skip_special_tokens=True)

        # Post-process the generated text if necessary (e.g., remove trailing unwanted characters)
        # Simple example: remove trailing whitespace or potential chat remnants
        generated_text = generated_text.strip()
        # You might need more sophisticated parsing depending on model output
        # For example, if it includes chat turns after the SQL, you'd need to extract just the SQL.


    except Exception as e:
        print(f"Error during text generation for example {i+1}: {e}")
        generated_text = "Error generating query." # Indicate failure


    print("\n--- Generated SQL Query ---\n")
    print(generated_text)

    # --- Calculate Metrics for the current example ---
    current_rouge_scores = None
    current_bleu_score = None

    if generated_text != "Error generating query.":
        try:
            # ROUGE Score Calculation
            # Pass ground truth and generated text strings to the scorer
            current_rouge_scores = rouge_scorer_obj.score(ground_truth_answer, generated_text)
            rouge_scores.append(current_rouge_scores)
            print(f"ROUGE Scores: ROUGE-1: {current_rouge_scores['rouge1'].fmeasure:.4f}, ROUGE-2: {current_rouge_scores['rouge2'].fmeasure:.4f}, ROUGE-L: {current_rouge_scores['rougeL'].fmeasure:.4f}")

            # BLEU Score Calculation
            current_bleu = sacrebleu.corpus_bleu([generated_text], [[ground_truth_answer]])
            current_bleu_score = current_bleu.score
            bleu_scores.append(current_bleu_score)
            print(f"BLEU Score: {current_bleu_score:.4f}")

        except Exception as e:
            print(f"Error calculating metrics for example {i+1}: {e}")
            # Metrics for this example will be None
    else:
         print("Skipping metric calculation due to generation error.")


    # Store results for later analysis
    results.append({
        "original_question": original_question,
        "database_context": database_context, # Optional, might be too long to store all
        "generated_query": generated_text,
        "ground_truth_query": ground_truth_answer, # Store ground truth SQL
        "rouge_scores": current_rouge_scores,       # Store the detailed ROUGE scores dict
        "bleu_score": current_bleu_score            # Store the BLEU score (float or None)
    })

print("\n--- Evaluation Loop Finished ---")

# --- 5. Analysis and Metrics Summary ---
print("\n--- Overall Evaluation Summary ---")

# Calculate and print average metrics
# Filter out None values before calculating averages
valid_rouge_scores = [s for s in rouge_scores if s is not None]
valid_bleu_scores = [s for s in bleu_scores if s is not None]

if valid_rouge_scores:
    avg_rouge1 = np.mean([s['rouge1'].fmeasure for s in valid_rouge_scores])
    avg_rouge2 = np.mean([s['rouge2'].fmeasure for s in valid_rouge_scores])
    avg_rougeL = np.mean([s['rougeL'].fmeasure for s in valid_rouge_scores])
    print(f"Average ROUGE-1 F-measure (over {len(valid_rouge_scores)} examples): {avg_rouge1:.4f}")
    print(f"Average ROUGE-2 F-measure (over {len(valid_rouge_scores)} examples): {avg_rouge2:.4f}")
    print(f"Average ROUGE-L F-measure (over {len(valid_rouge_scores)} examples): {avg_rougeL:.4f}")
else:
    print("No valid ROUGE scores were calculated.")


if valid_bleu_scores:
    avg_bleu = np.mean(valid_bleu_scores)
    print(f"Average BLEU Score (over {len(valid_bleu_scores)} examples): {avg_bleu:.4f}")
else:
    print("No valid BLEU scores were calculated.")

# --- Save Results ---
# Convert the list of results dictionaries to a pandas DataFrame and save to JSONL
try:
    df_results = pd.DataFrame(results)

    output_filename = "sql_evaluation_results_with_metrics.jsonl" # New filename
    df_results.to_json(output_filename, orient="records", lines=True)
    print(f"\nEvaluation complete. Detailed results saved to '{output_filename}'.")
except Exception as e:
    print(f"Error saving results to JSONL: {e}")
    print("Consider saving fewer details (e.g., only text outputs and average metrics) if this persists.")

Streaming output truncated to the last 5000 lines.

--- Ground Truth SQL Query (from dataset) ---

SELECT COUNT(final_episode) AS Count FROM table_11210576_4 WHERE character = "Rick Stetler"

--- Generated SQL Query ---

SELECT COUNT(final_episode) FROM table_11210576_4 WHERE character = "Rick Stetler"
ROUGE Scores: ROUGE-1: 0.9231, ROUGE-2: 0.8333, ROUGE-L: 0.9231
BLEU Score: 82.5718

--- Evaluation Case 668/999 ---
Original Question: In 1879-81 with number built 4, what is the LMS nos?
Database Schema:
CREATE TABLE table_name_63 (lms_nos VARCHAR, date VARCHAR, no_built VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT lms_nos FROM table_name_63 WHERE date = "1879-81" AND no_built = 4

--- Generated SQL Query ---

SELECT lms_nos FROM table_name_63 WHERE date = "1879-81" AND no_built = "4"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 88.6661

--- Evaluation Case 669/999 ---
Original Question: display the employee name ( first name and last name ) and hire date for all employees in the same department as Clara.
Database Schema:
CREATE TABLE employees (first_name VARCHAR, last_name VARCHAR, hire_date VARCHAR, department_id VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT first_name, last_name, hire_date FROM employees WHERE department_id = (SELECT department_id FROM employees WHERE first_name = "Clara")

--- Generated SQL Query ---

SELECT first_name, last_name, hire_date FROM employees WHERE department_id = (SELECT department_id FROM employees WHERE first_name = "Clara" AND last_name = "Perez" )
ROUGE Scores: ROUGE-1: 0.9130, ROUGE-2: 0.9091, ROUGE-L: 0.9130
BLEU Score: 79.4556

--- Evaluation Case 670/999 ---
Original Question: What is Richard Bachmann's PBA team?
Database Schema:
CREATE TABLE table_name_42 (pba_team VARCHAR, player VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT pba_team FROM table_name_42 WHERE player = "richard bachmann"

--- Generated SQL Query ---

SELECT pba_team FROM table_name_42 WHERE player = "richard bachmann"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 671/999 ---
Original Question: Who had the high assist total when the team was 0-1?
Database Schema:
CREATE TABLE table_27902171_4 (high_assists VARCHAR, record VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT high_assists FROM table_27902171_4 WHERE record = "0-1"

--- Generated SQL Query ---

SELECT high_assists FROM table_27902171_4 WHERE record = "0-1"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 672/999 ---
Original Question: Can you tell me the Nationality that has the Round smaller than 5, and the Player of bruce affleck?
Database Schema:
CREATE TABLE table_name_10 (nationality VARCHAR, round VARCHAR, player VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT nationality FROM table_name_10 WHERE round < 5 AND player = "bruce affleck"

--- Generated SQL Query ---

SELECT nationality FROM table_name_10 WHERE round < 5 AND player = "bruce affleck"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 673/999 ---
Original Question: what's the party with incumbent being william e. evans
Database Schema:
CREATE TABLE table_1342359_5 (party VARCHAR, incumbent VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT party FROM table_1342359_5 WHERE incumbent = "William E. Evans"

--- Generated SQL Query ---

(d) 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6% 80.4% 19.6
ROUGE Scores: ROUGE-1: 0.0000, ROUGE-2: 0.0000, ROUGE-L: 0.0000
BLEU Score: 0.0000

--- Evaluation Case 674/999 ---
Original Question: What is the serial format for white on blue with a serial issued of ss-00-00 to zz-99-99?
Database Schema:
CREATE TABLE table_name_72 (serial_format VARCHAR, design VARCHAR, serials_issued VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT serial_format FROM table_name_72 WHERE design = "white on blue" AND serials_issued = "ss-00-00 to zz-99-99"

--- Generated SQL Query ---

lásilSELECT serial_format FROM table_name_72 WHERE design = "white on blue" AND serials_issued = "ss-00-00 to zz-99-99"
ROUGE Scores: ROUGE-1: 0.9333, ROUGE-2: 0.9302, ROUGE-L: 0.9333
BLEU Score: 96.7168

--- Evaluation Case 675/999 ---
Original Question: How many people were in attendance for the game with a score of 98–111?
Database Schema:
CREATE TABLE table_name_12 (attendance INTEGER, score VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT SUM(attendance) FROM table_name_12 WHERE score = "98–111"

--- Generated SQL Query ---

ıldığındaSELECT AVG(attendance) FROM table_name_12 WHERE score = "98–111"
ROUGE Scores: ROUGE-1: 0.7826, ROUGE-2: 0.7619, ROUGE-L: 0.7826
BLEU Score: 87.0240

--- Evaluation Case 676/999 ---
Original Question: Which chemical class uses the example Chloroethane (ethyl chloride)?
Database Schema:
CREATE TABLE table_name_90 (chemical_class VARCHAR, example VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT chemical_class FROM table_name_90 WHERE example = "chloroethane (ethyl chloride)"

--- Generated SQL Query ---

SELECT chemical_class FROM table_name_90 WHERE example = "chloroethane (ethyl chloride)"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 677/999 ---
Original Question: Who was home on November 26?
Database Schema:
CREATE TABLE table_name_73 (home VARCHAR, date VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT home FROM table_name_73 WHERE date = "november 26"

--- Generated SQL Query ---

SELECT home FROM table_name_73 WHERE date = "november 26"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 678/999 ---
Original Question: Which Pre-Season has a A-League of 0 1, and a Finals larger than 0?
Database Schema:
CREATE TABLE table_name_4 (pre_season INTEGER, a_league VARCHAR, finals VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT MIN(pre_season) FROM table_name_4 WHERE a_league = "0 1" AND finals > 0

--- Generated SQL Query ---

SELECT AVG(pre_season) FROM table_name_4 WHERE a_league = "0 1" AND finals > 0
ROUGE Scores: ROUGE-1: 0.9375, ROUGE-2: 0.8667, ROUGE-L: 0.9375
BLEU Score: 92.7608

--- Evaluation Case 679/999 ---
Original Question: What is Model Number, when Voltage is 2.0V, and when Frequency is 350 mhz?
Database Schema:
CREATE TABLE table_name_2 (model_number VARCHAR, voltage VARCHAR, frequency VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT model_number FROM table_name_2 WHERE voltage = "2.0v" AND frequency = "350 mhz"

--- Generated SQL Query ---

SELECT model_number FROM table_name_2 WHERE voltage = "2.0v" AND frequency = "350 mhz"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 680/999 ---
Original Question: Name the venue for 19th date
Database Schema:
CREATE TABLE table_17120964_5 (venue VARCHAR, date VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT venue FROM table_17120964_5 WHERE date = "19th"

--- Generated SQL Query ---

19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007 19/05/2007
ROUGE Scores: ROUGE-1: 0.0000, ROUGE-2: 0.0000, ROUGE-L: 0.0000
BLEU Score: 0.0000

--- Evaluation Case 681/999 ---
Original Question: What is the church in the Sub-Parish of Fresvik called?
Database Schema:
CREATE TABLE table_name_94 (church_name VARCHAR, sub_parish__sokn_ VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT church_name FROM table_name_94 WHERE sub_parish__sokn_ = "fresvik"

--- Generated SQL Query ---

SELECT church_name FROM table_name_94 WHERE sub_parish__sokn_ = "fresvik"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 682/999 ---
Original Question: Which game number was played at Chicago Stadium?
Database Schema:
CREATE TABLE table_name_63 (game VARCHAR, location VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT game FROM table_name_63 WHERE location = "chicago stadium"

--- Generated SQL Query ---

SELECT game FROM table_name_63 WHERE location = "chicago stadium"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 683/999 ---
Original Question: Find the number of people who is under 40 for each gender.
Database Schema:
CREATE TABLE Person (gender VARCHAR, age INTEGER)

--- Ground Truth SQL Query (from dataset) ---

SELECT COUNT(*), gender FROM Person WHERE age < 40 GROUP BY gender

--- Generated SQL Query ---

SELECT COUNT(*), gender FROM Person WHERE age < 40 GROUP BY gender
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 684/999 ---
Original Question: What is the notes for the rowers from denmark?
Database Schema:
CREATE TABLE table_name_26 (notes VARCHAR, country VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT notes FROM table_name_26 WHERE country = "denmark"

--- Generated SQL Query ---

SELECT notes FROM table_name_26 WHERE country = "denmark"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 685/999 ---
Original Question: Who was the winner for ASTC round 8?
Database Schema:
CREATE TABLE table_name_63 (winner VARCHAR, series VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT winner FROM table_name_63 WHERE series = "astc round 8"

--- Generated SQL Query ---

SELECT winner FROM table_name_63 WHERE series = "astc round 8"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 686/999 ---
Original Question: What position has a height (cm) greater than 180, and brian lawton as the name?
Database Schema:
CREATE TABLE table_name_68 (position VARCHAR, height__cm_ VARCHAR, name VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT position FROM table_name_68 WHERE height__cm_ > 180 AND name = "brian lawton"

--- Generated SQL Query ---

SELECT position FROM table_name_68 WHERE height__cm_ > 180 AND name = "brian lawton"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 687/999 ---
Original Question: How many points were there when there were less than 16 rebounds and 5 assists?
Database Schema:
CREATE TABLE table_name_83 (points VARCHAR, assists VARCHAR, rebounds VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT COUNT(points) FROM table_name_83 WHERE assists = 5 AND rebounds < 16

--- Generated SQL Query ---

SELECT COUNT(points) FROM table_name_83 WHERE assists = 5 AND rebounds < 16
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 688/999 ---
Original Question: What was the date of the game attended by 25,022?
Database Schema:
CREATE TABLE table_name_70 (date VARCHAR, attendance VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT date FROM table_name_70 WHERE attendance = "25,022"

--- Generated SQL Query ---

SELECT date FROM table_name_70 WHERE attendance = "25,022"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 689/999 ---
Original Question: Name the Daytime which has Saturday of yes and a Name of exmouth?
Database Schema:
CREATE TABLE table_name_5 (daytime VARCHAR, saturday VARCHAR, name VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT daytime FROM table_name_5 WHERE saturday = "yes" AND name = "exmouth"

--- Generated SQL Query ---

SELECT daytime FROM table_name_5 WHERE saturday = "yes" AND name = "exmouth"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 690/999 ---
Original Question: For all games with los angeles as visitor, what is the highest attendance of all?
Database Schema:
CREATE TABLE table_name_12 (attendance INTEGER, visitor VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT MAX(attendance) FROM table_name_12 WHERE visitor = "los angeles"

--- Generated SQL Query ---

SELECT MAX(attendance) FROM table_name_12 WHERE visitor = "los angeles"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 691/999 ---
Original Question: What is the Pole Position for the German Grand Prix
Database Schema:
CREATE TABLE table_name_83 (pole_position VARCHAR, grand_prix VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT pole_position FROM table_name_83 WHERE grand_prix = "german grand prix"

--- Generated SQL Query ---

?ılmaktadırSELECT pole_position FROM table_name_83 WHERE grand_prix = "german grand prix"
ROUGE Scores: ROUGE-1: 0.8889, ROUGE-2: 0.8800, ROUGE-L: 0.8889
BLEU Score: 89.7077

--- Evaluation Case 692/999 ---
Original Question: Where the height range is higher than 20000.0 and the shell weight is 12.5, what is the time to feet ratio at 25 degrees?
Database Schema:
CREATE TABLE table_16439764_1 (time_to_ft__m__at_25°__seconds_ VARCHAR, shell__lb_ VARCHAR, max_height__ft_ VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT time_to_ft__m__at_25°__seconds_ FROM table_16439764_1 WHERE shell__lb_ = "12.5" AND max_height__ft_ > 20000.0

--- Generated SQL Query ---

SELECT time_to_ft__m__at_25°__seconds_ FROM table_16439764_1 WHERE shell__lb_ = "12.5" AND max_height__ft_ > 20000.0
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 693/999 ---
Original Question: What company collaborated with non-hodgkin lymphoma?
Database Schema:
CREATE TABLE table_name_5 (collaboration VARCHAR, indication VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT collaboration FROM table_name_5 WHERE indication = "non-hodgkin lymphoma"

--- Generated SQL Query ---

SELECT collaboration FROM table_name_5 WHERE indication = "non-hodgkin lymphoma"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 694/999 ---
Original Question: Which Power has Location in metro manila
Database Schema:
CREATE TABLE table_name_75 (power__kw_ VARCHAR, location VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT power__kw_ FROM table_name_75 WHERE location = "metro manila"

--- Generated SQL Query ---

?SELECT power__kw_ FROM table_name_75 WHERE location = "metro manila"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 94.5742

--- Evaluation Case 695/999 ---
Original Question: Which nationality is associated with Temple?
Database Schema:
CREATE TABLE table_name_72 (nationality VARCHAR, school_country VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT nationality FROM table_name_72 WHERE school_country = "temple"

--- Generated SQL Query ---

SELECT nationality FROM table_name_72 WHERE school_country = "temple"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 696/999 ---
Original Question: Which 2007 has a 2003 of 2r, and a 2004 of 1r?
Database Schema:
CREATE TABLE table_name_7 (Id VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT 2007 FROM table_name_7 WHERE 2003 = "2r" AND 2004 = "1r"

--- Generated SQL Query ---

SELECT 2007 FROM table_name_7 WHERE 2003 = "2r" AND 2004 = "1r"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 697/999 ---
Original Question: Who was the challenger on Episode 5?
Database Schema:
CREATE TABLE table_23982399_1 (challenger VARCHAR, overall_episode__number VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT challenger FROM table_23982399_1 WHERE overall_episode__number = 5

--- Generated SQL Query ---

SELECT challenger FROM table_23982399_1 WHERE overall_episode__number = 5
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 698/999 ---
Original Question: How many episodes in the season had 3.81 million US viewers?
Database Schema:
CREATE TABLE table_24319661_3 (no_in_season VARCHAR, us_viewers__million_ VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT COUNT(no_in_season) FROM table_24319661_3 WHERE us_viewers__million_ = "3.81"

--- Generated SQL Query ---

SELECT COUNT(no_in_season) FROM table_24319661_3 WHERE us_viewers__million_ = "3.81"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 699/999 ---
Original Question: Region of eastern england has what investment income?
Database Schema:
CREATE TABLE table_name_30 (investment_income VARCHAR, region VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT investment_income FROM table_name_30 WHERE region = "eastern england"

--- Generated SQL Query ---

SELECT investment_income FROM table_name_30 WHERE region = "eastern england"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 700/999 ---
Original Question: What is the socket when the sSpec number is standard power?
Database Schema:
CREATE TABLE table_name_96 (socket VARCHAR, sspec_number VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT socket FROM table_name_96 WHERE sspec_number = "standard power"

--- Generated SQL Query ---

SELECT socket FROM table_name_96 WHERE sspec_number = "standard power"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 701/999 ---
Original Question: Frequency of 1.2 ghz, and a Release price ( USD ) of $70 is what socket?
Database Schema:
CREATE TABLE table_name_91 (socket VARCHAR, frequency VARCHAR, release_price___usd__ VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT socket FROM table_name_91 WHERE frequency = "1.2 ghz" AND release_price___usd__ = "$70"

--- Generated SQL Query ---

SELECT socket FROM table_name_91 WHERE frequency = "1.2 ghz" AND release_price___usd__ = "$70"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 702/999 ---
Original Question: Who had a finish of t16?
Database Schema:
CREATE TABLE table_name_81 (player VARCHAR, finish VARCHAR)

--- Ground Truth SQL Query (from dataset) ---

SELECT player FROM table_name_81 WHERE finish = "t16"

--- Generated SQL Query ---

SELECT player FROM table_name_81 WHERE finish = "t16"
ROUGE Scores: ROUGE-1: 1.0000, ROUGE-2: 1.0000, ROUGE-L: 1.0000
BLEU Score: 100.0000

--- Evaluation Case 703/999 ---
Original Question: What match had 240 points for?
Database Schema: